Revit 2027 API
Document.ActiveView Property
The document's active view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public View ActiveView { get; }
Public ReadOnly Property ActiveView As View
	Get
public:
property View^ ActiveView {
	View^ get ();
}
member ActiveView : View with get
Property Value
View
The active view is the view that last had focus in the UI. null if no view is considered active.
Example
// Get the active view of the current document.
Autodesk.Revit.DB.View view = document.ActiveView;
// Get the class type of the active view, and format the prompt string
String prompt = "Revit is currently in ";
if (view is Autodesk.Revit.DB.View3D)
{
    prompt += "3D view.";
}
else if (view is Autodesk.Revit.DB.ViewSection)
{
    prompt += "section view.";
}
else if (view is Autodesk.Revit.DB.ViewSheet)
{
    prompt += "sheet view.";
}
else if (view is Autodesk.Revit.DB.ViewDrafting)
{
    prompt += "drafting view.";
}
else
{
    prompt += "normal view, the view name is " + view.Name;
}
// Give the user some information
TaskDialog.Show("Revit",prompt);
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace